<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use App\Models\Product;

class ProductsTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        Product::truncate();

        $param = [
            'name' => 'sandal1',
            'price' => 3000,
            'image' => 'beigesandal.jpg',
            'text1' => '毎日履きたくなる、スニーカー',
            'text2' =>
                '朝の支度が、格段に楽になる一足。シンプルで秋の来ないチームコートは、クリーンでモダンなデザインが魅力。合わせたいのは、デニムやバギースウェット。スタイリッシュなレザーアッパーとフレッシュなカラーが、どんなコーディネートも引き締めてくれる。もちろん、履き心地の良さもいう事なし',
        ];
        Product::create($param);
        $param = [
            'name' => 'sandal2',
            'price' => 3000,
            'image' => 'beigesandal.jpg',
            'text1' => '毎日履きたくなる、スニーカー',
            'text2' =>
                '朝の支度が、格段に楽になる一足。シンプルで秋の来ないチームコートは、クリーンでモダンなデザインが魅力。合わせたいのは、デニムやバギースウェット。スタイリッシュなレザーアッパーとフレッシュなカラーが、どんなコーディネートも引き締めてくれる。もちろん、履き心地の良さもいう事なし',
        ];
        Product::create($param);
        $param = [
            'name' => 'sandal3',
            'price' => 3000,
            'image' => 'beigesandal.jpg',
            'text1' => '毎日履きたくなる、スニーカー',
            'text2' =>
                '朝の支度が、格段に楽になる一足。シンプルで秋の来ないチームコートは、クリーンでモダンなデザインが魅力。合わせたいのは、デニムやバギースウェット。スタイリッシュなレザーアッパーとフレッシュなカラーが、どんなコーディネートも引き締めてくれる。もちろん、履き心地の良さもいう事なし',
        ];
        Product::create($param);
        $param = [
            'name' => 'sandal4',
            'price' => 3000,
            'image' => 'beigesandal.jpg',
            'text1' => '毎日履きたくなる、スニーカー',
            'text2' =>
                '朝の支度が、格段に楽になる一足。シンプルで秋の来ないチームコートは、クリーンでモダンなデザインが魅力。合わせたいのは、デニムやバギースウェット。スタイリッシュなレザーアッパーとフレッシュなカラーが、どんなコーディネートも引き締めてくれる。もちろん、履き心地の良さもいう事なし',
        ];
        Product::create($param);
        $param = [
            'name' => 'sandal5',
            'price' => 3000,
            'image' => 'beigesandal.jpg',
            'text1' => '毎日履きたくなる、スニーカー',
            'text2' =>
                '朝の支度が、格段に楽になる一足。シンプルで秋の来ないチームコートは、クリーンでモダンなデザインが魅力。合わせたいのは、デニムやバギースウェット。スタイリッシュなレザーアッパーとフレッシュなカラーが、どんなコーディネートも引き締めてくれる。もちろん、履き心地の良さもいう事なし',
        ];
        Product::create($param);
        $param = [
            'name' => 'sandal6',
            'price' => 3000,
            'image' => 'beigesandal.jpg',
            'text1' => '毎日履きたくなる、スニーカー',
            'text2' =>
                '朝の支度が、格段に楽になる一足。シンプルで秋の来ないチームコートは、クリーンでモダンなデザインが魅力。合わせたいのは、デニムやバギースウェット。スタイリッシュなレザーアッパーとフレッシュなカラーが、どんなコーディネートも引き締めてくれる。もちろん、履き心地の良さもいう事なし',
        ];
        Product::create($param);
        $param = [
            'name' => 'sandal7',
            'price' => 3000,
            'image' => 'beigesandal.jpg',
            'text1' => '毎日履きたくなる、スニーカー',
            'text2' =>
                '朝の支度が、格段に楽になる一足。シンプルで秋の来ないチームコートは、クリーンでモダンなデザインが魅力。合わせたいのは、デニムやバギースウェット。スタイリッシュなレザーアッパーとフレッシュなカラーが、どんなコーディネートも引き締めてくれる。もちろん、履き心地の良さもいう事なし',
        ];
        Product::create($param);
        $param = [
            'name' => 'sandal8',
            'price' => 3000,
            'image' => 'beigesandal.jpg',
            'text1' => '毎日履きたくなる、スニーカー',
            'text2' =>
                '朝の支度が、格段に楽になる一足。シンプルで秋の来ないチームコートは、クリーンでモダンなデザインが魅力。合わせたいのは、デニムやバギースウェット。スタイリッシュなレザーアッパーとフレッシュなカラーが、どんなコーディネートも引き締めてくれる。もちろん、履き心地の良さもいう事なし',
        ];
        Product::create($param);
        $param = [
            'name' => 'sandal9',
            'price' => 3000,
            'image' => 'beigesandal.jpg',
            'text1' => '毎日履きたくなる、スニーカー',
            'text2' =>
                '朝の支度が、格段に楽になる一足。シンプルで秋の来ないチームコートは、クリーンでモダンなデザインが魅力。合わせたいのは、デニムやバギースウェット。スタイリッシュなレザーアッパーとフレッシュなカラーが、どんなコーディネートも引き締めてくれる。もちろん、履き心地の良さもいう事なし',
        ];
        Product::create($param);
        $param = [
            'name' => 'sandal10',
            'price' => 3000,
            'image' => 'beigesandal.jpg',
            'text1' => '毎日履きたくなる、スニーカー',
            'text2' =>
                '朝の支度が、格段に楽になる一足。シンプルで秋の来ないチームコートは、クリーンでモダンなデザインが魅力。合わせたいのは、デニムやバギースウェット。スタイリッシュなレザーアッパーとフレッシュなカラーが、どんなコーディネートも引き締めてくれる。もちろん、履き心地の良さもいう事なし',
        ];
        Product::create($param);
        $param = [
            'name' => 'sandal11',
            'price' => 3000,
            'image' => 'beigesandal.jpg',
            'text1' => '毎日履きたくなる、スニーカー',
            'text2' =>
                '朝の支度が、格段に楽になる一足。シンプルで秋の来ないチームコートは、クリーンでモダンなデザインが魅力。合わせたいのは、デニムやバギースウェット。スタイリッシュなレザーアッパーとフレッシュなカラーが、どんなコーディネートも引き締めてくれる。もちろん、履き心地の良さもいう事なし',
        ];
        Product::create($param);
        $param = [
            'name' => 'sandal12',
            'price' => 3000,
            'image' => 'beigesandal.jpg',
            'text1' => '毎日履きたくなる、スニーカー',
            'text2' =>
                '朝の支度が、格段に楽になる一足。シンプルで秋の来ないチームコートは、クリーンでモダンなデザインが魅力。合わせたいのは、デニムやバギースウェット。スタイリッシュなレザーアッパーとフレッシュなカラーが、どんなコーディネートも引き締めてくれる。もちろん、履き心地の良さもいう事なし',
        ];
        Product::create($param);
        $param = [
            'name' => 'sandal13',
            'price' => 3000,
            'image' => 'beigesandal.jpg',
            'text1' => '毎日履きたくなる、スニーカー',
            'text2' =>
                '朝の支度が、格段に楽になる一足。シンプルで秋の来ないチームコートは、クリーンでモダンなデザインが魅力。合わせたいのは、デニムやバギースウェット。スタイリッシュなレザーアッパーとフレッシュなカラーが、どんなコーディネートも引き締めてくれる。もちろん、履き心地の良さもいう事なし',
        ];
        Product::create($param);
        $param = [
            'name' => 'sandal14',
            'price' => 3000,
            'image' => 'beigesandal.jpg',
            'text1' => '毎日履きたくなる、スニーカー',
            'text2' =>
                '朝の支度が、格段に楽になる一足。シンプルで秋の来ないチームコートは、クリーンでモダンなデザインが魅力。合わせたいのは、デニムやバギースウェット。スタイリッシュなレザーアッパーとフレッシュなカラーが、どんなコーディネートも引き締めてくれる。もちろん、履き心地の良さもいう事なし',
        ];
        Product::create($param);
        $param = [
            'name' => 'sandal15',
            'price' => 3000,
            'image' => 'beigesandal.jpg',
            'text1' => '毎日履きたくなる、スニーカー',
            'text2' =>
                '朝の支度が、格段に楽になる一足。シンプルで秋の来ないチームコートは、クリーンでモダンなデザインが魅力。合わせたいのは、デニムやバギースウェット。スタイリッシュなレザーアッパーとフレッシュなカラーが、どんなコーディネートも引き締めてくれる。もちろん、履き心地の良さもいう事なし',
        ];
        Product::create($param);
        $param = [
            'name' => 'sandal16',
            'price' => 3000,
            'image' => 'beigesandal.jpg',
            'text1' => '毎日履きたくなる、スニーカー',
            'text2' =>
                '朝の支度が、格段に楽になる一足。シンプルで秋の来ないチームコートは、クリーンでモダンなデザインが魅力。合わせたいのは、デニムやバギースウェット。スタイリッシュなレザーアッパーとフレッシュなカラーが、どんなコーディネートも引き締めてくれる。もちろん、履き心地の良さもいう事なし',
        ];
        Product::create($param);
        $param = [
            'name' => 'sandal17',
            'price' => 3000,
            'image' => 'beigesandal.jpg',
            'text1' => '毎日履きたくなる、スニーカー',
            'text2' =>
                '朝の支度が、格段に楽になる一足。シンプルで秋の来ないチームコートは、クリーンでモダンなデザインが魅力。合わせたいのは、デニムやバギースウェット。スタイリッシュなレザーアッパーとフレッシュなカラーが、どんなコーディネートも引き締めてくれる。もちろん、履き心地の良さもいう事なし',
        ];
        Product::create($param);
        $param = [
            'name' => 'sandal18',
            'price' => 3000,
            'image' => 'beigesandal.jpg',
            'text1' => '毎日履きたくなる、スニーカー',
            'text2' =>
                '朝の支度が、格段に楽になる一足。シンプルで秋の来ないチームコートは、クリーンでモダンなデザインが魅力。合わせたいのは、デニムやバギースウェット。スタイリッシュなレザーアッパーとフレッシュなカラーが、どんなコーディネートも引き締めてくれる。もちろん、履き心地の良さもいう事なし',
        ];
        Product::create($param);
        $param = [
            'name' => 'sandal19',
            'price' => 3000,
            'image' => 'beigesandal.jpg',
            'text1' => '毎日履きたくなる、スニーカー',
            'text2' =>
                '朝の支度が、格段に楽になる一足。シンプルで秋の来ないチームコートは、クリーンでモダンなデザインが魅力。合わせたいのは、デニムやバギースウェット。スタイリッシュなレザーアッパーとフレッシュなカラーが、どんなコーディネートも引き締めてくれる。もちろん、履き心地の良さもいう事なし',
        ];
        Product::create($param);
        $param = [
            'name' => 'sandal20',
            'price' => 3000,
            'image' => 'beigesandal.jpg',
            'text1' => '毎日履きたくなる、スニーカー',
            'text2' =>
                '朝の支度が、格段に楽になる一足。シンプルで秋の来ないチームコートは、クリーンでモダンなデザインが魅力。合わせたいのは、デニムやバギースウェット。スタイリッシュなレザーアッパーとフレッシュなカラーが、どんなコーディネートも引き締めてくれる。もちろん、履き心地の良さもいう事なし',
        ];
        Product::create($param);
        $param = [
            'name' => 'sandal21',
            'price' => 3000,
            'image' => 'beigesandal.jpg',
            'text1' => '毎日履きたくなる、スニーカー',
            'text2' =>
                '朝の支度が、格段に楽になる一足。シンプルで秋の来ないチームコートは、クリーンでモダンなデザインが魅力。合わせたいのは、デニムやバギースウェット。スタイリッシュなレザーアッパーとフレッシュなカラーが、どんなコーディネートも引き締めてくれる。もちろん、履き心地の良さもいう事なし',
        ];
        Product::create($param);
        $param = [
            'name' => 'sandal22',
            'price' => 3000,
            'image' => 'beigesandal.jpg',
            'text1' => '毎日履きたくなる、スニーカー',
            'text2' =>
                '朝の支度が、格段に楽になる一足。シンプルで秋の来ないチームコートは、クリーンでモダンなデザインが魅力。合わせたいのは、デニムやバギースウェット。スタイリッシュなレザーアッパーとフレッシュなカラーが、どんなコーディネートも引き締めてくれる。もちろん、履き心地の良さもいう事なし',
        ];
        Product::create($param);
        $param = [
            'name' => 'sandal23',
            'price' => 3000,
            'image' => 'beigesandal.jpg',
            'text1' => '毎日履きたくなる、スニーカー',
            'text2' =>
                '朝の支度が、格段に楽になる一足。シンプルで秋の来ないチームコートは、クリーンでモダンなデザインが魅力。合わせたいのは、デニムやバギースウェット。スタイリッシュなレザーアッパーとフレッシュなカラーが、どんなコーディネートも引き締めてくれる。もちろん、履き心地の良さもいう事なし',
        ];
        Product::create($param);
        $param = [
            'name' => 'sandal24',
            'price' => 3000,
            'image' => 'beigesandal.jpg',
            'text1' => '毎日履きたくなる、スニーカー',
            'text2' =>
                '朝の支度が、格段に楽になる一足。シンプルで秋の来ないチームコートは、クリーンでモダンなデザインが魅力。合わせたいのは、デニムやバギースウェット。スタイリッシュなレザーアッパーとフレッシュなカラーが、どんなコーディネートも引き締めてくれる。もちろん、履き心地の良さもいう事なし',
        ];
        Product::create($param);
        $param = [
            'name' => 'sandal25',
            'price' => 3000,
            'image' => 'beigesandal.jpg',
            'text1' => '毎日履きたくなる、スニーカー',
            'text2' =>
                '朝の支度が、格段に楽になる一足。シンプルで秋の来ないチームコートは、クリーンでモダンなデザインが魅力。合わせたいのは、デニムやバギースウェット。スタイリッシュなレザーアッパーとフレッシュなカラーが、どんなコーディネートも引き締めてくれる。もちろん、履き心地の良さもいう事なし',
        ];
        Product::create($param);
        $param = [
            'name' => 'sandal26',
            'price' => 3000,
            'image' => 'beigesandal.jpg',
            'text1' => '毎日履きたくなる、スニーカー',
            'text2' =>
                '朝の支度が、格段に楽になる一足。シンプルで秋の来ないチームコートは、クリーンでモダンなデザインが魅力。合わせたいのは、デニムやバギースウェット。スタイリッシュなレザーアッパーとフレッシュなカラーが、どんなコーディネートも引き締めてくれる。もちろん、履き心地の良さもいう事なし',
        ];
        Product::create($param);
        $param = [
            'name' => 'sandal27',
            'price' => 3000,
            'image' => 'beigesandal.jpg',
            'text1' => '毎日履きたくなる、スニーカー',
            'text2' =>
                '朝の支度が、格段に楽になる一足。シンプルで秋の来ないチームコートは、クリーンでモダンなデザインが魅力。合わせたいのは、デニムやバギースウェット。スタイリッシュなレザーアッパーとフレッシュなカラーが、どんなコーディネートも引き締めてくれる。もちろん、履き心地の良さもいう事なし',
        ];
        Product::create($param);
        $param = [
            'name' => 'sandal28',
            'price' => 3000,
            'image' => 'beigesandal.jpg',
            'text1' => '毎日履きたくなる、スニーカー',
            'text2' =>
                '朝の支度が、格段に楽になる一足。シンプルで秋の来ないチームコートは、クリーンでモダンなデザインが魅力。合わせたいのは、デニムやバギースウェット。スタイリッシュなレザーアッパーとフレッシュなカラーが、どんなコーディネートも引き締めてくれる。もちろん、履き心地の良さもいう事なし',
        ];
        Product::create($param);
        $param = [
            'name' => 'sandal29',
            'price' => 3000,
            'image' => 'beigesandal.jpg',
            'text1' => '毎日履きたくなる、スニーカー',
            'text2' =>
                '朝の支度が、格段に楽になる一足。シンプルで秋の来ないチームコートは、クリーンでモダンなデザインが魅力。合わせたいのは、デニムやバギースウェット。スタイリッシュなレザーアッパーとフレッシュなカラーが、どんなコーディネートも引き締めてくれる。もちろん、履き心地の良さもいう事なし',
        ];
        Product::create($param);
        $param = [
            'name' => 'sandal30',
            'price' => 3000,
            'image' => 'beigesandal.jpg',
            'text1' => '毎日履きたくなる、スニーカー',
            'text2' =>
                '朝の支度が、格段に楽になる一足。シンプルで秋の来ないチームコートは、クリーンでモダンなデザインが魅力。合わせたいのは、デニムやバギースウェット。スタイリッシュなレザーアッパーとフレッシュなカラーが、どんなコーディネートも引き締めてくれる。もちろん、履き心地の良さもいう事なし',
        ];
        Product::create($param);
        $param = [
            'name' => 'sandal31',
            'price' => 3000,
            'image' => 'beigesandal.jpg',
            'text1' => '毎日履きたくなる、スニーカー',
            'text2' =>
                '朝の支度が、格段に楽になる一足。シンプルで秋の来ないチームコートは、クリーンでモダンなデザインが魅力。合わせたいのは、デニムやバギースウェット。スタイリッシュなレザーアッパーとフレッシュなカラーが、どんなコーディネートも引き締めてくれる。もちろん、履き心地の良さもいう事なし',
        ];
        Product::create($param);
        $param = [
            'name' => 'sandal32',
            'price' => 3000,
            'image' => 'beigesandal.jpg',
            'text1' => '毎日履きたくなる、スニーカー',
            'text2' =>
                '朝の支度が、格段に楽になる一足。シンプルで秋の来ないチームコートは、クリーンでモダンなデザインが魅力。合わせたいのは、デニムやバギースウェット。スタイリッシュなレザーアッパーとフレッシュなカラーが、どんなコーディネートも引き締めてくれる。もちろん、履き心地の良さもいう事なし',
        ];
        Product::create($param);
        $param = [
            'name' => 'sandal33',
            'price' => 3000,
            'image' => 'beigesandal.jpg',
            'text1' => '毎日履きたくなる、スニーカー',
            'text2' =>
                '朝の支度が、格段に楽になる一足。シンプルで秋の来ないチームコートは、クリーンでモダンなデザインが魅力。合わせたいのは、デニムやバギースウェット。スタイリッシュなレザーアッパーとフレッシュなカラーが、どんなコーディネートも引き締めてくれる。もちろん、履き心地の良さもいう事なし',
        ];
        Product::create($param);
        $param = [
            'name' => 'sandal34',
            'price' => 3000,
            'image' => 'beigesandal.jpg',
            'text1' => '毎日履きたくなる、スニーカー',
            'text2' =>
                '朝の支度が、格段に楽になる一足。シンプルで秋の来ないチームコートは、クリーンでモダンなデザインが魅力。合わせたいのは、デニムやバギースウェット。スタイリッシュなレザーアッパーとフレッシュなカラーが、どんなコーディネートも引き締めてくれる。もちろん、履き心地の良さもいう事なし',
        ];
        Product::create($param);
        $param = [
            'name' => 'sandal35',
            'price' => 3000,
            'image' => 'beigesandal.jpg',
            'text1' => '毎日履きたくなる、スニーカー',
            'text2' =>
                '朝の支度が、格段に楽になる一足。シンプルで秋の来ないチームコートは、クリーンでモダンなデザインが魅力。合わせたいのは、デニムやバギースウェット。スタイリッシュなレザーアッパーとフレッシュなカラーが、どんなコーディネートも引き締めてくれる。もちろん、履き心地の良さもいう事なし',
        ];
        Product::create($param);
        $param = [
            'name' => 'sandal36',
            'price' => 3000,
            'image' => 'beigesandal.jpg',
            'text1' => '毎日履きたくなる、スニーカー',
            'text2' =>
                '朝の支度が、格段に楽になる一足。シンプルで秋の来ないチームコートは、クリーンでモダンなデザインが魅力。合わせたいのは、デニムやバギースウェット。スタイリッシュなレザーアッパーとフレッシュなカラーが、どんなコーディネートも引き締めてくれる。もちろん、履き心地の良さもいう事なし',
        ];
        Product::create($param);
        $param = [
            'name' => 'sandal37',
            'price' => 3000,
            'image' => 'beigesandal.jpg',
            'text1' => '毎日履きたくなる、スニーカー',
            'text2' =>
                '朝の支度が、格段に楽になる一足。シンプルで秋の来ないチームコートは、クリーンでモダンなデザインが魅力。合わせたいのは、デニムやバギースウェット。スタイリッシュなレザーアッパーとフレッシュなカラーが、どんなコーディネートも引き締めてくれる。もちろん、履き心地の良さもいう事なし',
        ];
        Product::create($param);
        $param = [
            'name' => 'sandal38',
            'price' => 3000,
            'image' => 'beigesandal.jpg',
            'text1' => '毎日履きたくなる、スニーカー',
            'text2' =>
                '朝の支度が、格段に楽になる一足。シンプルで秋の来ないチームコートは、クリーンでモダンなデザインが魅力。合わせたいのは、デニムやバギースウェット。スタイリッシュなレザーアッパーとフレッシュなカラーが、どんなコーディネートも引き締めてくれる。もちろん、履き心地の良さもいう事なし',
        ];
        Product::create($param);
        $param = [
            'name' => 'sandal39',
            'price' => 3000,
            'image' => 'beigesandal.jpg',
            'text1' => '毎日履きたくなる、スニーカー',
            'text2' =>
                '朝の支度が、格段に楽になる一足。シンプルで秋の来ないチームコートは、クリーンでモダンなデザインが魅力。合わせたいのは、デニムやバギースウェット。スタイリッシュなレザーアッパーとフレッシュなカラーが、どんなコーディネートも引き締めてくれる。もちろん、履き心地の良さもいう事なし',
        ];
        Product::create($param);
        $param = [
            'name' => 'sandal40',
            'price' => 3000,
            'image' => 'beigesandal.jpg',
            'text1' => '毎日履きたくなる、スニーカー',
            'text2' =>
                '朝の支度が、格段に楽になる一足。シンプルで秋の来ないチームコートは、クリーンでモダンなデザインが魅力。合わせたいのは、デニムやバギースウェット。スタイリッシュなレザーアッパーとフレッシュなカラーが、どんなコーディネートも引き締めてくれる。もちろん、履き心地の良さもいう事なし',
        ];
        Product::create($param);
    }
}
